app/views/artists/_form.html.erb

SELECT "genres".* FROM "genres"
---
     <%= f.label :genre %>
     <%= f.select :genre_ids, options_for_select(Genre.all.collect { |a| [a.name, a.id] }) %>