app/views/artists/index.html.erb

        <% if user_signed_in? %>
            <% @user = User.find(current_user.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]


                <% artist.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "artist_genres" ON "genres"."id" = "artist_genres"."genre_id" WHERE "artist_genres"."artist_id" = $1  [["artist_id", 6]]

                    <% end %>
                    <% if @user.artists.include? artist %>
---
SELECT  1 AS one FROM "artists" INNER JOIN "followed_artists" ON "artists"."id" = "followed_artists"."artist_id" WHERE "followed_artists"."user_id" = $1 AND "artists"."id" = $2 LIMIT $3  [["user_id", 37], ["id", 6], ["LIMIT", 1]]
SELECT "artists".* FROM "artists" ORDER BY created_at DESC