app/views/artists/show.html.erb

SELECT "genres".* FROM "genres" INNER JOIN "artist_genres" ON "genres"."id" = "artist_genres"."genre_id" WHERE "artist_genres"."artist_id" = $1  [["artist_id", 5]]
---
              <strong>Genres:</strong>
              <% @artist.genres.each do |genre| %>

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 5]]
SELECT  "albums".* FROM "albums" WHERE "albums"."name" = $1 LIMIT $2  [["name", "Weightless"], ["LIMIT", 1]]
---
            <ul class="alt">
                <% @artist.albums.each do |album| %>
                    <li><%= link_to album.name, Album.find_by_name(album.name) %></li>

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
---
                <% if user_signed_in?
                    if User.find(current_user.id).artist_calification

SELECT "artist_reviews".* FROM "artist_reviews"
---
    </header>
    <% ArtistReview.all.each do |r| %>

SELECT COUNT(*) FROM "artist_reviews" WHERE "artist_reviews"."artist_id" = $1  [["artist_id", 6]]
---
    <% end %>
    <% if ArtistReview.where(artist_id: @artist.id).size == 0 %>