app/views/users/admin_dashboard.html.erb

SELECT "users".* FROM "users" ORDER BY created_at DESC
SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (last_sign_in_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_day_last_sign_in_at_timestamptz_interval_0_second_at FROM "users" WHERE (last_sign_in_at IS NOT NULL) GROUP BY (DATE_TRUNC('day', (last_sign_in_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'
---
        <h5>Users created by day</h5>
          <%= area_chart User.group_by_day(:created_at).count, download: true, xtitle: "Date", ytitle: "Number of Users" %>

SELECT COUNT(*) AS count_all, "users"."admin" AS users_admin FROM "users" GROUP BY "users"."admin"
---
        <h5>Users by admin role</h5>
          <%= pie_chart User.group(:admin).count, download: true %>

SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_day_created_at_timestamptz_interval_0_second_at_time FROM "playlists" WHERE (created_at IS NOT NULL) GROUP BY (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'
---
          <h5>Playlists created by day</h5>
            <%= area_chart Playlist.group_by_day(:created_at).count, download: true, xtitle: "Date", ytitle: "Number of Playlists"%>

SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_day_created_at_timestamptz_interval_0_second_at_time FROM "songs" WHERE (created_at IS NOT NULL) GROUP BY (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'
---
        <h5>Songs created by day</h5>
          <%= line_chart Song.group_by_day(:created_at).count, download: true, xtitle: "Date", ytitle: "Number of Songs"%>

SELECT COUNT(*) AS count_all, "songs"."artist_id" AS songs_artist_id FROM "songs" GROUP BY "songs"."artist_id"
SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_day_created_at_timestamptz_interval_0_second_at_time FROM "artists" WHERE (created_at IS NOT NULL) GROUP BY (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'
---
        <h5>Songs by artist</h5>
          <%= column_chart Song.group(:artist).count, download: true, xtitle: "Date", ytitle: "Number of Songs"  %>

SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_day_created_at_timestamptz_interval_0_second_at_time FROM "albums" WHERE (created_at IS NOT NULL) GROUP BY (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'
---
        <h5>Albums created by day</h5>
          <%= line_chart Album.group_by_day(:created_at).count, download: true, xtitle: "Date", ytitle: "Number of Albums"%>