app/views/users/show.html.erb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = $1  [["user_id", 37]]
---
                    <ul class="alt">
                        <% Playlist.where(user_id: @user.id).each do |p|%>