app/views/users/your_library.html.erb

                  <td><%= link_to song.name, song %></td>
                  <td><%= link_to Album.find(song.album_id).name, Album.find(song.album_id) %></td>
                  <td><%= link_to Artist.find(song.artist_id).name, Artist.find(song.artist_id) %></td>
                  <% if user_signed_in?%>
                    <% if @user.songs.include? song %>
---
SELECT "albums".* FROM "albums" INNER JOIN "followed_albums" ON "albums"."id" = "followed_albums"."album_id" WHERE "followed_albums"."user_id" = $1  [["user_id", 37]]
SELECT "artists".* FROM "artists" INNER JOIN "followed_artists" ON "artists"."id" = "followed_artists"."artist_id" WHERE "followed_artists"."user_id" = $1  [["user_id", 37]]
SELECT "songs".* FROM "songs" INNER JOIN "followed_songs" ON "songs"."id" = "followed_songs"."song_id" WHERE "followed_songs"."user_id" = $1  [["user_id", 37]]


                      <% album.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "album_genres" ON "genres"."id" = "album_genres"."genre_id" WHERE "album_genres"."album_id" = $1  [["album_id", 4]]


                          <% artist.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "artist_genres" ON "genres"."id" = "artist_genres"."genre_id" WHERE "artist_genres"."artist_id" = $1  [["artist_id", 3]]