app/views/songs/_form.html.erb

SELECT "artists".* FROM "artists"
---
     <%= f.label :artist %>
     <%= f.select :artist_id, options_for_select(Artist.all.collect { |a| [a.name, a.id] }) %>

SELECT "albums".* FROM "albums"
---
     <%= f.label :album %>
     <%= f.select :album_id, options_for_select(Album.all.collect { |a| [a.name, a.id] }) %>