app/views/songs/index.html.erb

        <% if user_signed_in? %>
            <% @user = User.find(current_user.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]

                <td><%= link_to song.name, song_path(song.id) %></td>
                <td><%= link_to Album.find(song.album_id).name, Album.find(song.album_id) %></td>
                <td><%= link_to Artist.find(song.artist_id).name, Artist.find(song.artist_id) %></td>
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

                  <% end %>
                  <% if @user.songs.include? song %>
---
SELECT  1 AS one FROM "songs" INNER JOIN "followed_songs" ON "songs"."id" = "followed_songs"."song_id" WHERE "followed_songs"."user_id" = $1 AND "songs"."id" = $2 LIMIT $3  [["user_id", 37], ["id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE (name ILIKE '%david%' ) ORDER BY created_at DESC