app/views/songs/show.html.erb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
              <strong>Album:</strong>
              <%= Album.find(@song.album_id).name %>

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
              <strong>Artist:</strong>
              <%= Artist.find(@song.artist_id).name %>

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
                <% if user_signed_in?
                    if User.find(current_user.id).song_calification