app/views/albums/_form.html.erb

     <%= f.label :artist %>
     <%= f.select :artist_id, options_for_select(Artist.all.collect { |a| [a.name, a.id] }) %>
---
SELECT "artists".* FROM "artists"

     <%= f.label :genre %>
     <%= f.select :genre_ids, options_for_select(Genre.all.collect { |a| [a.name, a.id] }) %>
---
SELECT "genres".* FROM "genres"