app/views/albums/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]
---
        <% if user_signed_in? %>
            <% @user = User.find(current_user.id) %>

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "album_genres" ON "genres"."id" = "album_genres"."genre_id" WHERE "album_genres"."album_id" = $1  [["album_id", 5]]
---
                    <td><%= link_to album.name, album_path(album.id)%></td>
                    <td><%= link_to Artist.find(album.artist_id).name, Artist.find(album.artist_id) %></td>

                    <% album.genres.each do |genre| %>

SELECT  1 AS one FROM "albums" INNER JOIN "followed_albums" ON "albums"."id" = "followed_albums"."album_id" WHERE "followed_albums"."user_id" = $1 AND "albums"."id" = $2 LIMIT $3  [["user_id", 37], ["id", 5], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" ORDER BY created_at DESC
---
                    <% end %>
                    <% if @user.albums.include? album %>