app/views/albums/show.html.erb

              <strong>Artist:</strong>
              <%= Artist.find(@album.artist_id).name %>
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

              <strong>Genres:</strong>
              <% @album.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "album_genres" ON "genres"."id" = "album_genres"."genre_id" WHERE "album_genres"."album_id" = $1  [["album_id", 13]]

                <% if user_signed_in?
                    if User.find(current_user.id).album_calification
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

            <ul class="alt">
                <% @album.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 13]]

    </header>
    <% AlbumReview.all.each do |r| %>
---
SELECT "album_reviews".* FROM "album_reviews"

    <% end %>
    <% if AlbumReview.where(album_id: @album.id).size == 0 %>
---
SELECT COUNT(*) FROM "album_reviews" WHERE "album_reviews"."album_id" = $1  [["album_id", 4]]