app/views/homes/index.html.erb

SELECT "reports".* FROM "reports"
---
        </header>
        <% Report.all.each do |r| %>