app/views/homes/index.html.erb

    </header>
    <% New.all.each do |n| %>
---
SELECT "news".* FROM "news"