app/controllers/album_califications_controller.rb

INSERT INTO "album_califications" ("album_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["album_id", 7], ["user_id", 4], ["created_at", "2017-11-27 02:23:54.053812"], ["updated_at", "2017-11-27 02:23:54.053812"]]
---
  def create
    @album_calification = AlbumCalification.new(album_calification_params)

    respond_to do |format|
      if @album_calification.save

UPDATE "album_califications" SET "album_id" = $1, "updated_at" = $2 WHERE "album_califications"."id" = $3  [["album_id", 2], ["updated_at", "2017-11-27 01:08:34.839867"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @album_calification.update(album_calification_params)

SELECT  "album_califications".* FROM "album_califications" WHERE "album_califications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_album_calification
      @album_calification = AlbumCalification.find(params[:id])