app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT "albums".* FROM "albums" ORDER BY created_at DESC

  def show
    Yt.configure do |config|
      config.api_key = 'AIzaSyC9JzNrzyv99S7ldhQeVZykEBYRb9Mffsc'
      @albums = Album.all
    end
    artist_name = Artist.find(@album.artist_id).name
    videos = Yt::Collections::Videos.new
    id_video = videos.where(q: @album.name + ' ' +artist_name,
          order: 'relevance').first.id
    @url_youtube = '//www.youtube.com/embed/' + id_video

    if params[:follow] == 'F'
        User.find(current_user.id).albums << @album
---
SELECT "albums".* FROM "albums"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]