app/controllers/artist_reviews_controller.rb

INSERT INTO "artist_reviews" ("artist_id", "user_id", "review", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist_id", 6], ["user_id", 37], ["review", "Que gran artista ste m3n"], ["created_at", "2017-11-26 20:48:30.789257"], ["updated_at", "2017-11-26 20:48:30.789257"]]
---
  def create
    @artist_review = ArtistReview.new(artist_review_params)

    respond_to do |format|
      if @artist_review.save