app/controllers/artist_califications_controller.rb

  def create
    @artist_calification = ArtistCalification.new(artist_calification_params)

    respond_to do |format|
      if @artist_calification.save
---
INSERT INTO "artist_califications" ("artist_id", "user_id", "grade", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist_id", 14], ["user_id", 4], ["grade", 4], ["created_at", "2017-11-27 03:03:51.953388"], ["updated_at", "2017-11-27 03:03:51.953388"]]