app/controllers/artists_controller.rb

  def index
    @artists = Artist.all
---
SELECT "artists".* FROM "artists" ORDER BY created_at DESC

  def show
    Yt.configure do |config|
      config.api_key = 'AIzaSyC9JzNrzyv99S7ldhQeVZykEBYRb9Mffsc'
    end
    videos = Yt::Collections::Videos.new
    id_video = videos.where(q: @artist.name, order: 'relevance').first.id
    @url_youtube = '//www.youtube.com/embed/' + id_video

    @artists = Artist.all
    if params[:follow] == 'F'
        User.find(current_user.id).artists << @artist
---
SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]