app/controllers/genres_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "album_genres" ON "genres"."id" = "album_genres"."genre_id" WHERE "album_genres"."album_id" = $1  [["album_id", 5]]
SELECT "genres".* FROM "genres" ORDER BY created_at DESC
---
  def index
    if params[:artist_id]
      @genres = Artist.find(params[:artist_id]).genres
    elsif params[:album_id]
      @genres = Album.find(params[:album_id]).genres
    else
      @genres = Genre.all

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_genre
      @genre = Genre.find(params[:id])