app/controllers/playlist_califications_controller.rb

INSERT INTO "playlist_califications" ("playlist_id", "user_id", "grade", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["playlist_id", 1], ["user_id", 4], ["grade", 3], ["created_at", "2017-11-27 02:34:22.122398"], ["updated_at", "2017-11-27 02:34:22.122398"]]
---
  def create
    @playlist_calification = PlaylistCalification.new(playlist_calification_params)

    respond_to do |format|
      if @playlist_calification.save

SELECT  "playlist_califications".* FROM "playlist_califications" WHERE "playlist_califications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_playlist_calification
      @playlist_calification = PlaylistCalification.find(params[:id])