app/controllers/playlists_controller.rb

  def show
        if user_signed_in?
            if params[:follow] == 'U'
                User.find(current_user.id).playlists.delete(@playlist)
            elsif params[:follow] == 'F'
                User.find(current_user.id).playlists << @playlist
            end
            if params[:song_id] && params[:r]
                @playlist.songs.delete(Song.find(params[:song_id]))
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" INNER JOIN "in_playlists" ON "songs"."id" = "in_playlists"."song_id" WHERE "in_playlists"."playlist_id" = $1  [["playlist_id", 7]]

  def create
    @playlist = Playlist.new(playlist_params)
    @playlist.user_id = current_user.id

    respond_to do |format|
      if @playlist.save
---
INSERT INTO "playlists" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "La mejor playlist"], ["created_at", "2017-11-26 21:02:39.747953"], ["updated_at", "2017-11-26 21:02:39.747953"], ["user_id", 37]]

  def follow
      User.find(current_user.id).playlists << @playlist
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]

    def set_playlist
      @playlist = Playlist.find(params[:id])
      @user = User.find(@playlist.user_id)
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]