app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT "songs".* FROM "songs" WHERE (name ILIKE '%david%' ) ORDER BY created_at DESC

  def show
    Yt.configure do |config|
      config.api_key = 'AIzaSyC9JzNrzyv99S7ldhQeVZykEBYRb9Mffsc'
    @songs = Song.all
    if params[:follow] == 'F'
        User.find(current_user.id).songs << @song
---
SELECT "songs".* FROM "songs" ORDER BY created_at DESC
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]

  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("name", "album_id", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Que lindo el pavo real"], ["album_id", 5], ["artist_id", 1], ["created_at", "2017-11-26 21:28:12.612258"], ["updated_at", "2017-11-26 21:28:12.612258"]]