app/controllers/users_controller.rb

    def index
        @users = User.all
---
SELECT "users".* FROM "users" ORDER BY created_at DESC

    def admin_dashboard
      @users = User.all
---
SELECT "users".* FROM "users" ORDER BY created_at DESC

    def change_role
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]