app/views/playlists/show.html.erb

SELECT  1 AS one FROM "playlists" INNER JOIN "followed_playlists" ON "playlists"."id" = "followed_playlists"."playlist_id" WHERE "followed_playlists"."user_id" = $1 AND "playlists"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
---
                <% if user_signed_in? %>
                    <% if @user.playlists.include? @playlist %>

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
                        <% if user_signed_in?
                            if User.find(current_user.id).playlist_calification

SELECT "songs".* FROM "songs" INNER JOIN "in_playlists" ON "songs"."id" = "in_playlists"."song_id" WHERE "in_playlists"."playlist_id" = $1  [["playlist_id", 1]]
---
                    <ul class="alt">
                        <% @playlist.songs.each do |s|%>

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
                        <td><%= link_to song.name, song %></td>
                        <td><%= link_to Album.find(song.album_id).name, Album.find(song.album_id) %></td>
                        <td><%= link_to Artist.find(song.artist_id).name, Artist.find(song.artist_id) %></td>

SELECT "playlist_reviews".* FROM "playlist_reviews"
---
    </header>
    <% PlaylistReview.all.each do |r| %>

SELECT COUNT(*) FROM "playlist_reviews" WHERE "playlist_reviews"."playlist_id" = $1  [["playlist_id", 7]]
---
    <% end %>
    <% if PlaylistReview.where(playlist_id: @playlist.id).size == 0 %>